---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireTypeSetIterator
source: html/3a76651c-dd91-ec9d-9979-50b0af3d462b.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSetIterator

An iterator to a wire type set.

## Syntax (C#)
```csharp
public abstract class WireTypeSetIterator : APIObject,
	IEnumerator
```